app/controllers/concursos_controller.rb

  def index
    @concursos = Concurso.all
---
SELECT "concursos".* FROM "concursos"

  def show
    @concurso = Concurso.find(params[:id])
---
SELECT "concursos".* FROM "concursos" WHERE "concursos"."id" = 1 LIMIT 1

  def edit
    @concurso = Concurso.find(params[:id])
---
SELECT "concursos".* FROM "concursos" WHERE "concursos"."id" = 1 LIMIT 1

  def create
    @concurso = Concurso.new(params[:concurso])

    respond_to do |format|
      if @concurso.save
---
INSERT INTO "concursos" ("contratante_id", "created_at", "fim", "ganhador_id", "inicio", "nome", "premio", "updated_at") VALUES (0, '2012-09-20 01:25:32.840000', '2012-09-20 01:21:00.000000', NULL, '2012-09-20 01:20:00.000000', 'Teste', NULL, '2012-09-20 01:25:32.840000')

  def update
    @concurso = Concurso.find(params[:id])

    respond_to do |format|
      if @concurso.update_attributes(params[:concurso])
---
SELECT "concursos".* FROM "concursos" WHERE "concursos"."id" = 1 LIMIT 1
UPDATE "concursos" SET "ganhador_id" = 1, "contratante_id" = 1, "updated_at" = '2012-09-20 02:07:21.024000' WHERE "concursos"."id" = 1