app/controllers/contests_controller.rb

  def index
    if current_user.instance_of? Contractor
      @contests = Contest.find_all_by_contractor_id(current_user.id)
    else
      @contests = Contest.all
---
SELECT "contests".* FROM "contests" WHERE "contests"."contractor_id" = 1
SELECT "contests".* FROM "contests"

  def show
    @contest = Contest.find(params[:id])
---
SELECT "contests".* FROM "contests" WHERE "contests"."id" = 1 LIMIT 1

  def edit
    @contest = Contest.find(params[:id])
---
SELECT "contests".* FROM "contests" WHERE "contests"."id" = 1 LIMIT 1

  def create
    @contest = Contest.new(params[:contest])
    @contest.contractor_id = current_user.id

    respond_to do |format|
      if @contest.save
---
INSERT INTO "contests" ("contractor_id", "created_at", "description", "end", "name", "prize", "start", "updated_at", "winner_id") VALUES (1, '2012-10-07 17:14:57.884000', 'test', '2012-10-08', 'Test', 123123123.0, '2012-10-07', '2012-10-07 17:14:57.884000', NULL)

  def update
    @contest = Contest.find(params[:id])

    respond_to do |format|
      if @contest.update_attributes(params[:contest])
---
SELECT "contests".* FROM "contests" WHERE "contests"."id" = 1 LIMIT 1
UPDATE "contests" SET "prize" = 465.0, "start" = '2012-10-15', "end" = '2012-10-16', "updated_at" = '2012-10-17 21:18:45.734000' WHERE "contests"."id" = 1

  def destroy
    @contest = Contest.find(params[:id])
    @contest.destroy
---
SELECT "contests".* FROM "contests" WHERE "contests"."id" = 1 LIMIT 1
DELETE FROM "contests" WHERE "contests"."id" = 1