app/controllers/employees_controller.rb

  def index
    @employees = Employee.all
---
SELECT "employees".* FROM "employees"

  def show
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1

  def edit
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 2 LIMIT 1

  def create
    @employee = Employee.new(params[:employee])

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("created_at", "hire_date", "name", "updated_at") VALUES ('2012-09-07 17:26:53.690000', '2012-09-07', 'Michel da Cunha Henrich', '2012-09-07 17:26:53.690000')

  def update
    @employee = Employee.find(params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 2 LIMIT 1

  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1
DELETE FROM "employees" WHERE "employees"."id" = 1