app/controllers/proposals_controller.rb

SELECT "contests".* FROM "contests" WHERE "contests"."id" = 1 LIMIT 1
SELECT "proposals".* FROM "proposals" WHERE "proposals"."contest_id" = 1
---
  def index
    @contest = Contest.find_by_id(params[:contest_id])
    @proposals = Proposal.find_all_by_contest_id(params[:contest_id])

SELECT "contests".* FROM "contests" WHERE "contests"."id" = 2 LIMIT 1
SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = 1 LIMIT 1
---
  def show
    @contest = Contest.find_by_id(params[:contest_id])
    @proposal = Proposal.find_by_id(params[:proposal_id])

SELECT "contests".* FROM "contests" WHERE "contests"."id" = 2 LIMIT 1
---
  def new
    @contest = Contest.find_by_id(params[:contest_id])