app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "password", "password_salt", "persistence_token", "type", "updated_at", "username") VALUES ('2012-10-07 17:38:14.034000', '10533a85697e05e5927cdca3e8c2161b8529d9a1cd0037dea35c2e5f3a93ccc91a31ce1bb0d099c19ad5360b9ee1d81492063bdc595757d750862764acca2e44', 'michelchenrich@gmail.com', NULL, 'l6DcGv3WvHalepqoNqJY', '623df0fb82f6361c9100134e0868e94954091eb19b82b15faa959011d424d6228aa3c0d3a70e6c68b1dd5fd6533c61d25a752b5682179256e8d937d42801d4e1', 'Contractor', '2012-10-07 17:38:14.034000', 'Michel Henrich')

  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "password_salt" = 'tg2hfdLfC55M728SoHf', "crypted_password" = '1d1d5c33b762ce9a2269f314b20a0e964d4f052cc8501353c5710cc968ccd78ed7140a336bd3bccb0d81dad9ddd0553ba21a53d08bda49a52d059de17a6064f6', "persistence_token" = '8b8247cce874f3c8d591aaaf0c7a4f24134776cccd615f2af728f88385f6eca3d0899ef41a731e8ff13394dc4c548c906f99e6e38c02c816ac5038b757714a2c', "updated_at" = '2012-09-26 21:12:18.431000' WHERE "users"."id" = 1

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1