app/controllers/usuarios_controller.rb

  def index
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def show
    @usuario = Usuario.find(params[:id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = 1 LIMIT 1

  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "usuarios" ("created_at", "email", "nome", "senha", "updated_at") VALUES ('2012-09-20 02:06:42.876000', 'usuario@teste.1', 'Usuário de teste 1', 'usuario@teste.1', '2012-09-20 02:06:42.876000')